ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/adpd4000_sqi/sqi_task.c
/**
*******************************************************************************
* @file         sqi_task.c
* @author       ADI
* @version      V1.0.0
* @date         17-April-2020
* @brief        Source file contains sqi processing wrapper.
*
*******************************************************************************
* @attention
*******************************************************************************
*/
/******************************************************************************
*                                                                             *
* License Agreement                                                           *
*                                                                             *
* Copyright (c) 2020 Analog Devices Inc.                                      *
* All rights reserved.                                                        *
*                                                                             *
* This source code is intended for the recipient only under the guidelines of *
* the non-disclosure agreement with Analog Devices Inc.                       *
*                                                                             *
* THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR  *
* IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,    *
* FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE *
* AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER      *
* LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING     *
* FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER         *
* DEALINGS IN THE SOFTWARE.                                                   *
*                                                                             *
*                                                                             *
* This software is intended for use with the sqi                     *
*                                                                             *
*                                                                             *
******************************************************************************/
#ifdef ENABLE_SQI_APP
#include <sqi_application_interface.h>
#include <sqi_task.h>
#include <task_includes.h>
#include <string.h>
#include <stdint.h>
#include "post_office_interface.h"
#include "m2m2_core.h"
#include "Common.h"
#include "adi_sqi_algo.h"
#include "adi_vsm_sqi.h"
#include "adpd4000_task.h"
#include "post_office.h"
#include "nrf_log.h"
#ifdef PROFILE_TIME_ENABLED
#include <us_tick.h>
#endif

#define SQI_ALGO_MAJOR_VERSION     ((ADI_SQI_VERSION_NUM >> 16) & 0xFF)
#define SQI_ALGO_MINOR_VERSION     ((ADI_SQI_VERSION_NUM >> 8) & 0xFF)
#define SQI_ALGO_PATCH_VERSION     (ADI_SQI_VERSION_NUM & 0xFF)

#define SQI_APP_MAX_LCFG_OPS (10)
/* -------------------------Public variables -------------------------------*/
uint32_t  gnSQI_Slot = 0x20; //slot-F;
uint32_t  sqi_event;
#ifdef DEBUG_PKT
uint32_t g_sqi_pkt_cnt = 0;
#endif
extern g_state_t  g_state;

/* flag to check if adpd data is externally fed for sqi stream */
extern bool gAdpd_ext_data_stream_active;
/* odr for externally fed adpd data */
extern uint16_t gAdpd_ext_data_stream_odr;

#undef PROFILE_TIME

/* ------------------------- Private variables ----------------------------- */
// Create the stack for task
uint8_t sqi_task_stack[APP_OS_CFG_SQI_APP_TASK_STK_SIZE];

// Create handler for task
ADI_OSAL_THREAD_HANDLE sqi_task_handler;

// Create task attributes variable
ADI_OSAL_STATIC_THREAD_ATTR sqi_task_attributes;

// Create TCB for task
StaticTask_t sqi_task_tcb;

// Create semaphores
ADI_OSAL_SEM_HANDLE   sqi_task_evt_sem;

// Create Queue Handler for task
ADI_OSAL_QUEUE_HANDLE  sqi_task_msg_queue = NULL;
ADI_OSAL_MUTEX_HANDLE g_sqi_data_lock;

const char GIT_SQI_VERSION[] = "TEST SQI_VERSION STRING";
const uint8_t GIT_SQI_VERSION_LEN = sizeof(GIT_SQI_VERSION);

typedef  m2m2_hdr_t*(app_cb_function_t)(m2m2_hdr_t*);

static struct _g_state_sqi {
  uint16_t nSubscriberCount;
  uint16_t nSequenceCount;
  uint16_t nStreamStartCount;
  uint16_t nSQIODR;
} g_state_sqi = {0, 0, 0, 0};

typedef struct _app_routing_table_entry_t {
  uint8_t                    command;
  app_cb_function_t          *cb_handler;
}app_routing_table_entry_t;

/* ------------------------- Private Function Prototypes ------------------- */

static m2m2_hdr_t *sqi_stream_config(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *sqi_lcfg_access(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *sqi_status(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *sqi_get_version(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *sqi_set_adpd_slot(m2m2_hdr_t *p_pkt);
static void sqi_task(void *pArgument);
static void packetize_sqi_data(uint32_t nSQIData, uint32_t nTimeStamp);

app_routing_table_entry_t sqi_routing_table[] = {
  {M2M2_APP_COMMON_CMD_STREAM_START_REQ, sqi_stream_config},
  {M2M2_APP_COMMON_CMD_STREAM_STOP_REQ, sqi_stream_config},
  {M2M2_APP_COMMON_CMD_STREAM_SUBSCRIBE_REQ, sqi_stream_config},
  {M2M2_APP_COMMON_CMD_STREAM_UNSUBSCRIBE_REQ, sqi_stream_config},
  {M2M2_APP_COMMON_CMD_SENSOR_STATUS_QUERY_REQ, sqi_status},
  {M2M2_APP_COMMON_CMD_GET_VERSION_REQ, sqi_get_version},
  {M2M2_SQI_APP_CMD_GET_ALGO_VENDOR_VERSION_REQ, sqi_get_version},
  {M2M2_APP_COMMON_CMD_WRITE_LCFG_REQ, sqi_lcfg_access},
  {M2M2_APP_COMMON_CMD_READ_LCFG_REQ, sqi_lcfg_access},
  {M2M2_SQI_APP_CMD_SET_SLOT_REQ, sqi_set_adpd_slot},
};

#define SQI_APP_ROUTING_TBL_SZ (sizeof(sqi_routing_table) / sizeof(sqi_routing_table[0]))

SQI_ALG_RETURN_CODE_t sqi_algo_init(uint8_t input_sample_freq);

void send_message_sqi_app_task(m2m2_hdr_t *p_pkt) {
  ADI_OSAL_STATUS osal_result;
  osal_result = adi_osal_MsgQueuePost(sqi_task_msg_queue,p_pkt);
  if (osal_result != ADI_OSAL_SUCCESS)
    post_office_consume_msg(p_pkt);
  adi_osal_SemPost(sqi_task_evt_sem);
}

void sqi_app_task_init(void) {
  ADI_OSAL_STATUS eOsStatus = ADI_OSAL_SUCCESS;
  sqi_task_attributes.pThreadFunc = sqi_task;
  sqi_task_attributes.nPriority = APP_OS_CFG_SQI_APP_TASK_PRIO;
  sqi_task_attributes.pStackBase = &sqi_task_stack[0];
  sqi_task_attributes.nStackSize = APP_OS_CFG_SQI_APP_TASK_STK_SIZE;
  sqi_task_attributes.pTaskAttrParam = NULL;
  sqi_task_attributes.szThreadName = "SQI";
  sqi_task_attributes.pThreadTcb = &sqi_task_tcb;

  eOsStatus = adi_osal_MsgQueueCreate(&sqi_task_msg_queue,NULL,
                                    5);
  if (eOsStatus != ADI_OSAL_SUCCESS) {
      Debug_Handler();
  }
  else
  {
    update_task_queue_list(APP_OS_CFG_SQI_TASK_INDEX,sqi_task_msg_queue);
  }

  eOsStatus = adi_osal_ThreadCreateStatic(&sqi_task_handler,
                                    &sqi_task_attributes);
  if (eOsStatus != ADI_OSAL_SUCCESS) {
      Debug_Handler();
  }

