ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/adpd4000_sqi/sqi_task.c
  eOsStatus = adi_osal_MutexCreate(&g_sqi_data_lock);
  if (eOsStatus != ADI_OSAL_SUCCESS) {
      Debug_Handler();
  }

  eOsStatus = adi_osal_SemCreate(&sqi_task_evt_sem, 0U);
  if (eOsStatus != ADI_OSAL_SUCCESS) {
      Debug_Handler();
  }

}

  uint32_t pn_RData=0;
  uint32_t  nTimestamp = 0;
static void sqi_task(void *pArgument) {
  m2m2_hdr_t *p_in_pkt = NULL;
  m2m2_hdr_t *p_out_pkt = NULL;
  ADI_OSAL_STATUS         err;

  post_office_add_mailbox(M2M2_ADDR_MED_SQI, M2M2_ADDR_MED_SQI_STREAM);
  while (1)
  {
      adi_osal_SemPend(sqi_task_evt_sem, ADI_OSAL_TIMEOUT_FOREVER);
      p_in_pkt = post_office_get(ADI_OSAL_TIMEOUT_NONE, APP_OS_CFG_SQI_TASK_INDEX);
      if (p_in_pkt == NULL) {
        // No m2m2 messages to process, so fetch some data from the device.
          uint32_t nSQIData = pn_RData;
          packetize_sqi_data(nSQIData, nTimestamp);
      } else {
        // We got an m2m2 message from the queue, process it.
       PYLD_CST(p_in_pkt, _m2m2_app_common_cmd_t, p_in_cmd);
       // Look up the appropriate function to call in the function table
        for (int i = 0; i < SQI_APP_ROUTING_TBL_SZ; i++) {
          if (sqi_routing_table[i].command == p_in_cmd->command) {
            p_out_pkt = sqi_routing_table[i].cb_handler(p_in_pkt);
            break;
          }
        }
        post_office_consume_msg(p_in_pkt);
        if (p_out_pkt != NULL) {
          post_office_send(p_out_pkt, &err);
        }
      }
  }
}

#ifdef PROFILE_SQI
#define SQI_TIME_WINDOW 5.12f
uint16_t gSqiSampleCnt = 0, gSqiReqSampleCnt = 0;
uint32_t gSqiStartTime = 0, gSqiEndTime = 0, gSqiTotalTime = 0;
#endif
static void packetize_sqi_data(uint32_t nSQIData, uint32_t nTimeStamp) {
  m2m2_hdr_t *resp_pkt;
  ADI_OSAL_STATUS err;
  adi_vsm_sqi_output_t sqi_result;
  SQI_ALG_RETURN_CODE_t alg_ret_code = SQI_ALG_SUCCESS;
  SQI_ERROR_CODE_t sqi_ret_code = SQI_SUCCESS;

  memset(&sqi_result, 0x00, sizeof(sqi_result));
  if (g_state_sqi.nStreamStartCount > 0) {
#ifdef PROFILE_SQI
      gSqiSampleCnt++;
      if(gSqiSampleCnt == gSqiReqSampleCnt)
      {
         adi_osal_EnterCriticalRegion();
#ifdef PROFILE_TIME_ENABLED
         gSqiStartTime = get_micro_sec();
#else
         gSqiStartTime = MCU_HAL_GetTick();
#endif
      }
#endif
      alg_ret_code = SqiAlgProcess(nSQIData, &sqi_result);
#ifdef PROFILE_SQI
     if(gSqiSampleCnt == gSqiReqSampleCnt)
      {
#ifdef PROFILE_TIME_ENABLED
         gSqiEndTime = get_micro_sec();
#else
         gSqiEndTime = MCU_HAL_GetTick();
#endif
         gSqiTotalTime = gSqiEndTime - gSqiStartTime;
         gSqiSampleCnt = 0;
         adi_osal_ExitCriticalRegion();
      }
#endif
      switch(alg_ret_code){
        case SQI_ALG_BUFFERING:
         {
           return;
         }
        case SQI_ALG_SUCCESS:
        {
          sqi_ret_code = SQI_SUCCESS;
          break;
        }
        case SQI_ALG_NULL_PTR_ERROR:
        {
         sqi_result.sqi = -1;
         sqi_ret_code = SQI_NULL_PTR_ERROR;
         break;
        }
        case SQI_ALG_DIV_BY_ZERO_ERROR:
        {
         sqi_result.sqi = -1;
         sqi_ret_code = SQI_DIV_BY_ZERO_ERROR;
         break;
        }
        default:
        {
          sqi_result.sqi = -1;
          sqi_ret_code = SQI_ERROR;
          NRF_LOG_INFO("SQI algo: Received error from Algo");
          break;
        }
      }
      if (g_state_sqi.nSubscriberCount > 0) {
       adi_osal_EnterCriticalRegion();
       resp_pkt = post_office_create_msg(M2M2_HEADER_SZ + sizeof(sqi_app_stream_t));
       if(resp_pkt != NULL)
       {
#ifdef DEBUG_PKT
         g_sqi_pkt_cnt++;
#endif
         sqi_app_stream_t resp_sqi;
         resp_pkt->src = M2M2_ADDR_MED_SQI;
         resp_pkt->dest = M2M2_ADDR_MED_SQI_STREAM;
         resp_pkt->length = M2M2_HEADER_SZ + sizeof(sqi_app_stream_t);
         resp_sqi.command = (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_SENSOR_COMMON_CMD_STREAM_DATA;
         resp_sqi.sequence_num = g_state_sqi.nSequenceCount++;
         resp_sqi.status = M2M2_APP_COMMON_STATUS_OK;
         resp_sqi.sqi = sqi_result.sqi;
         resp_sqi.nAlgoStatus = sqi_ret_code;
         resp_sqi.nTimeStamp = nTimeStamp;
         resp_sqi.nReserved = 0;  // not used now, hence set to zero
         memcpy(&resp_pkt->data[0], &resp_sqi,  sizeof(sqi_app_stream_t));
         post_office_send(resp_pkt,&err);
        }
        adi_osal_ExitCriticalRegion();
      }
  }
}

static m2m2_hdr_t *sqi_get_version(m2m2_hdr_t *p_pkt) {
    // Declare a pointer to access the input packet payload
  PYLD_CST(p_pkt, m2m2_app_common_sub_op_t, p_in_payload);

  PKT_MALLOC(p_resp_pkt, m2m2_app_common_version_t, 0);
  // Declare a pointer to the response packet payload
  PYLD_CST(p_resp_pkt, m2m2_app_common_version_t, p_resp_payload);
  p_resp_payload->status = M2M2_APP_COMMON_STATUS_ERROR;
  switch(p_in_payload->command){
  case M2M2_APP_COMMON_CMD_GET_VERSION_REQ:
    p_resp_payload->command = M2M2_APP_COMMON_CMD_GET_VERSION_RESP;
    p_resp_payload->major = SQI_ALGO_MAJOR_VERSION;
    p_resp_payload->minor = SQI_ALGO_MINOR_VERSION;
    p_resp_payload->patch = SQI_ALGO_PATCH_VERSION;
    memcpy(&p_resp_payload->str[0], &GIT_SQI_VERSION, GIT_SQI_VERSION_LEN);
    p_resp_payload->status = M2M2_APP_COMMON_STATUS_OK;
    break;
  case M2M2_SQI_APP_CMD_GET_ALGO_VENDOR_VERSION_REQ: {
    char aNameStr[40];
    p_resp_payload->command = M2M2_SQI_APP_CMD_GET_ALGO_VENDOR_VERSION_RESP;

    p_resp_payload->major = SQI_ALGO_MAJOR_VERSION;
    p_resp_payload->minor = SQI_ALGO_MINOR_VERSION;
    p_resp_payload->patch = SQI_ALGO_PATCH_VERSION;
    memcpy(&p_resp_payload->verstr[0], "-HC",  4);
    strcpy((char *)aNameStr, "ADI SQI");
    memcpy(p_resp_payload->str, aNameStr, sizeof(aNameStr));
    p_resp_payload->status = M2M2_APP_COMMON_STATUS_OK;
    break;
    }
  }
  p_resp_pkt->src = p_pkt->dest;
  p_resp_pkt->dest = p_pkt->src;
  p_resp_pkt->checksum = 0x0000;

  return p_resp_pkt;
}

static m2m2_hdr_t *sqi_status(m2m2_hdr_t *p_pkt) {
  // Declare and malloc a response packet
  PKT_MALLOC(p_resp_pkt, m2m2_app_common_status_t, 0);
  // Declare a pointer to the response packet payload
  PYLD_CST(p_resp_pkt, m2m2_app_common_status_t, p_resp_payload);

  p_resp_payload->command = M2M2_APP_COMMON_CMD_SENSOR_STATUS_QUERY_RESP;
  p_resp_payload->status = M2M2_APP_COMMON_STATUS_ERROR;

  if (g_state_sqi.nStreamStartCount == 0) {
    p_resp_payload->status = M2M2_APP_COMMON_STATUS_STREAM_STOPPED;
  } else {
    p_resp_payload->status = M2M2_APP_COMMON_STATUS_STREAM_STARTED;
  }
  p_resp_payload->stream = M2M2_ADDR_MED_SQI_STREAM;
  p_resp_payload->num_subscribers = g_state_sqi.nSubscriberCount;
  p_resp_payload->num_start_reqs = g_state_sqi.nStreamStartCount;
  p_resp_pkt->src = p_pkt->dest;
  p_resp_pkt->dest = p_pkt->src;
  return p_resp_pkt;
}

static m2m2_hdr_t *sqi_stream_config(m2m2_hdr_t *p_pkt) {
  M2M2_APP_COMMON_STATUS_ENUM_t status = M2M2_APP_COMMON_STATUS_ERROR;
  M2M2_APP_COMMON_CMD_ENUM_t    command;
  SQI_ALG_RETURN_CODE_t ret_code;

  // Declare a pointer to access the input packet payload
  PYLD_CST(p_pkt, m2m2_app_common_sub_op_t, p_in_payload);
  // Declare and malloc a response packet
  PKT_MALLOC(p_resp_pkt, m2m2_app_common_sub_op_t, 0);
  // Declare a pointer to the response packet payload
  PYLD_CST(p_resp_pkt, m2m2_app_common_sub_op_t, p_resp_payload);

