ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/adpd4000_sqi/sqi_task.c
  switch (p_in_payload->command) {
  case M2M2_APP_COMMON_CMD_STREAM_START_REQ:
    if(gAdpd_ext_data_stream_active)
    {
      g_state_sqi.nSQIODR = gAdpd_ext_data_stream_odr;
    }
    else
    {
      Adpd400xDrvGetParameter(ADPD400x_OUTPUTDATARATE, log2(gnSQI_Slot), &g_state_sqi.nSQIODR);
    }
#ifdef PROFILE_SQI
    gSqiSampleCnt = 0;
    gSqiReqSampleCnt = g_state_sqi.nSQIODR * SQI_TIME_WINDOW;
#endif
    if (g_state_sqi.nStreamStartCount == 0) {
      if( SQI_ALG_SUCCESS == sqi_algo_init(g_state_sqi.nSQIODR))
      {
        g_state_sqi.nStreamStartCount = 1;
        status = M2M2_APP_COMMON_STATUS_STREAM_STARTED;
      }
      else
      {
        status = M2M2_APP_COMMON_STATUS_STREAM_NOT_STARTED;
      }
    }
    else
    {
      g_state_sqi.nStreamStartCount++;
      status = M2M2_APP_COMMON_STATUS_STREAM_IN_PROGRESS;
    }
    command = M2M2_APP_COMMON_CMD_STREAM_START_RESP;
    break;
  case M2M2_APP_COMMON_CMD_STREAM_STOP_REQ:
    if (g_state_sqi.nStreamStartCount == 0)
    {
      status = M2M2_APP_COMMON_STATUS_STREAM_STOPPED;
    }
    else if (g_state_sqi.nStreamStartCount == 1)
    {
        ret_code = SqiAlgReset();
        g_state_sqi.nStreamStartCount = 0;
        g_state_sqi.nSQIODR = 0;
        g_state_sqi.nSequenceCount = 0;
        if(gAdpd_ext_data_stream_active)
          gAdpd_ext_data_stream_active = false;
        if(SQI_ALG_SUCCESS == ret_code)
          status = M2M2_APP_COMMON_STATUS_STREAM_STOPPED;
    }
    else
    {
      g_state_sqi.nStreamStartCount--;
      status = M2M2_APP_COMMON_STATUS_STREAM_COUNT_DECREMENT;
    }
    command = M2M2_APP_COMMON_CMD_STREAM_STOP_RESP;
    break;
  case M2M2_APP_COMMON_CMD_STREAM_SUBSCRIBE_REQ:
    sqi_event = 1;
    g_state_sqi.nSubscriberCount++;
    //gnSQI_Slot = 0x20; //slot-F
    post_office_setup_subscriber(M2M2_ADDR_MED_SQI, M2M2_ADDR_MED_SQI_STREAM, p_pkt->src, true);
    status = M2M2_APP_COMMON_STATUS_SUBSCRIBER_ADDED;
    command = M2M2_APP_COMMON_CMD_STREAM_SUBSCRIBE_RESP;
    break;
  case M2M2_APP_COMMON_CMD_STREAM_UNSUBSCRIBE_REQ:
    if (g_state_sqi.nSubscriberCount <= 1)
    {
      sqi_event = 0;
      g_state_sqi.nSubscriberCount = 0;
      gnSQI_Slot = 0;
      status = M2M2_APP_COMMON_STATUS_SUBSCRIBER_REMOVED;
    }
    else
    {
      g_state_sqi.nSubscriberCount--;
      status = M2M2_APP_COMMON_STATUS_SUBSCRIBER_COUNT_DECREMENT;
    }
    post_office_setup_subscriber(M2M2_ADDR_MED_SQI, M2M2_ADDR_MED_SQI_STREAM, p_pkt->src, false);
    command = M2M2_APP_COMMON_CMD_STREAM_UNSUBSCRIBE_RESP;
    break;
  default:
    post_office_consume_msg(p_resp_pkt);
    return NULL;
  }
  p_resp_payload->command = command;
  p_resp_payload->status = status;
  p_resp_payload->stream = p_in_payload->stream;
  p_resp_pkt->src = p_pkt->dest;
  p_resp_pkt->dest = p_pkt->src;
  return p_resp_pkt;
}

/**
  * @internal
  * @brief    Example of how to write an LCFG parameter
  * @param    LCFG field that has to be written
  * @param    Value to be written
  * @retval   SQI_STATUS_ENUM_t
  */

SQI_ERROR_CODE_t sqi_writeLCFG(uint8_t field, uint16_t value) {
  if(field < SQI_LCFG_MAX){
    switch(field){
    }
    return SQI_SUCCESS;
  }
  return SQI_ERROR;
}

/**
  * @internal
  * @brief    Read LCFG parameter
  * @param    LCFG field
  * @param    Returned corresponding LCFG value
  * @retval   SQI_STATUS_ENUM_t
  */
SQI_ERROR_CODE_t sqi_readLCFG(uint8_t index, uint16_t *value) {
    if(index < SQI_LCFG_MAX){
        switch(index){
        }
        return SQI_SUCCESS;
    }
    return SQI_ERROR;
}

static m2m2_hdr_t *sqi_lcfg_access(m2m2_hdr_t *p_pkt) {
    M2M2_APP_COMMON_STATUS_ENUM_t status = M2M2_APP_COMMON_STATUS_ERROR;
    // Declare a pointer to access the input packet payload
    PYLD_CST(p_pkt, sqi_app_lcfg_op_hdr_t, p_in_payload);
    // Allocate a response packet with space for the correct number of operations
    PKT_MALLOC(p_resp_pkt, sqi_app_lcfg_op_hdr_t, p_in_payload->num_ops * sizeof(p_in_payload->ops[0]));
    PYLD_CST(p_resp_pkt, sqi_app_lcfg_op_hdr_t, p_resp_payload);
    uint16_t  reg_data = 0;

    switch (p_in_payload->command) {
    case M2M2_APP_COMMON_CMD_READ_LCFG_REQ:
      for (int i = 0; i < p_in_payload->num_ops; i++) {
        if (sqi_readLCFG(p_in_payload->ops[i].field, &reg_data) == SQI_SUCCESS)
        {
          status = M2M2_APP_COMMON_STATUS_OK;
        }
        else
        {
          status = M2M2_APP_COMMON_STATUS_ERROR;
        }
        p_resp_payload->ops[i].field = p_in_payload->ops[i].field;
        p_resp_payload->ops[i].value = reg_data;
      }
      p_resp_payload->command = (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_APP_COMMON_CMD_READ_LCFG_RESP;
      break;
    case M2M2_APP_COMMON_CMD_WRITE_LCFG_REQ:
      for (int i = 0; i < p_in_payload->num_ops; i++) {
        if (sqi_writeLCFG(p_in_payload->ops[i].field, p_in_payload->ops[i].value) == SQI_SUCCESS)
        {
          status = M2M2_APP_COMMON_STATUS_OK;
        }
        else
        {
          status = M2M2_APP_COMMON_STATUS_ERROR;
        }
        p_resp_payload->ops[i].field = p_in_payload->ops[i].field;
        p_resp_payload->ops[i].value = p_in_payload->ops[i].value;
      }
      p_resp_payload->command = (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_APP_COMMON_CMD_WRITE_LCFG_RESP;
      break;
    default:
      // Something has gone horribly wrong.
      post_office_consume_msg(p_resp_pkt);
      return NULL;
     }
    p_resp_pkt->dest = p_pkt->src;
    p_resp_pkt->src = p_pkt->dest;
    p_resp_payload->num_ops = p_in_payload->num_ops;
    p_resp_payload->status = status;
    return p_resp_pkt;
}

static m2m2_hdr_t *sqi_set_adpd_slot(m2m2_hdr_t *p_pkt) {
    M2M2_APP_COMMON_STATUS_ENUM_t status = M2M2_APP_COMMON_STATUS_ERROR;
    // Declare a pointer to access the input packet payload
    PYLD_CST(p_pkt, sqi_app_set_slot_t, p_in_payload);
    // Allocate a response packet with space for the correct number of operations
    PKT_MALLOC(p_resp_pkt, sqi_app_set_slot_t, 0);
    PYLD_CST(p_resp_pkt, sqi_app_set_slot_t, p_resp_payload);

