ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/adpd4000_sqi/sqi_task.c
    switch (p_in_payload->command) {
    case M2M2_SQI_APP_CMD_SET_SLOT_REQ:
      gnSQI_Slot = p_in_payload->nSQISlot;
      status = M2M2_APP_COMMON_STATUS_OK;
      p_resp_payload->command = M2M2_SQI_APP_CMD_SET_SLOT_RESP;
      break;
    default:
      // Something has gone horribly wrong.
      post_office_consume_msg(p_resp_pkt);
      return NULL;
     }
    p_resp_pkt->dest = p_pkt->src;
    p_resp_pkt->src = p_pkt->dest;
    p_resp_payload->nSQISlot = p_in_payload->nSQISlot;
    p_resp_payload->status = status;
    return p_resp_pkt;
}

void send_sqi_app_data(uint32_t *p_adpd_data, uint32_t ts)
{
   pn_RData = *p_adpd_data;
   nTimestamp = ts;
   adi_osal_SemPost(sqi_task_evt_sem);
}

uint32_t gStateMem = 0;
/***************************SQI configurations****************************************************/
/* Allocate a max amount of memory for the SQI Algo state memory block */
#define STATE_SQI_MEM_NUM_CHARS  3816 /* actual 3815 */

unsigned char STATE_memory_SQI[STATE_SQI_MEM_NUM_CHARS];

adi_vsm_sqi_mem_t sqi_memory_setup;

adi_vsm_sqi_instance_t* sqi_instance = NULL;

adi_vsm_sqi_config_t config_handle;

adi_vsm_sqi_output_t adi_vsm_sqi_output;

#ifdef PROFILE_TIME
#include "adi_vsm_cycle_count.h"
volatile uint32_t gn_sqi_algo_cycle_cnt=0;
#endif

SQI_ALG_RETURN_CODE_t SqiAlgConfig(uint8_t input_sample_freq)
{
    if (input_sample_freq != 25 && 
            input_sample_freq != 50 && 
                   input_sample_freq != 100)
    {
        return SQI_ALG_ERROR;
    }
    config_handle.sampling_freq = input_sample_freq;
    return SQI_ALG_SUCCESS;
}

SQI_ALG_RETURN_CODE_t SqiAlgInit(const adi_vsm_sqi_config_t* config_params)
{

    /* initialize the memory object for the SQI instance */
    sqi_memory_setup.state.block = STATE_memory_SQI;
    sqi_memory_setup.state.length_numchars = STATE_SQI_MEM_NUM_CHARS;
    gStateMem = adi_vsm_sqi_numchars_state_memory();
    /* Create the SQI Measurement instance */
    sqi_instance = adi_vsm_sqi_create(&sqi_memory_setup, config_params);
    if (sqi_instance == NULL) {
        return SQI_ALG_ERROR;
    }
    return SQI_ALG_SUCCESS;
}

SQI_ALG_RETURN_CODE_t SqiAlgReset()
{
    if (adi_vsm_sqi_frontend_reset(sqi_instance) != ADI_VSM_SQI_SUCCESS)
    {
        return SQI_ALG_ERROR;
    }
    return SQI_ALG_SUCCESS;
}

SQI_ALG_RETURN_CODE_t SqiAlgProcess(float input_sample,
                                    adi_vsm_sqi_output_t* adi_vsm_sqi_output)
{
    adi_vsm_sqi_return_code_t ret_code;
#ifdef PROFILE_TIME
    uint32_t sqi_algo_start_cnt = 0, sqi_algo_stop_cnt = 0;
    static uint8_t algo_status = 0;//not_done
    if(algo_status == 0)
    {
      sqi_algo_start_cnt = adi_GetStartCycleCount();
      algo_status = 1; //in progress
    }
#endif //#ifdef PROFILE_TIME
    ret_code = adi_vsm_sqi_process(sqi_instance, input_sample, adi_vsm_sqi_output);
    switch (ret_code)
    {
    case ADI_VSM_SQI_BUFFERING:
    {
        return SQI_ALG_BUFFERING;
    }
    case ADI_VSM_SQI_NULL_PTR_ERROR:
    {
        return SQI_ALG_NULL_PTR_ERROR;
    }
    case ADI_VSM_SQI_DIV_BY_ZERO_ERROR:
    {
        return SQI_ALG_DIV_BY_ZERO_ERROR;
    }
    case ADI_VSM_SQI_SUCCESS:
    {
#ifdef PROFILE_TIME
        if(algo_status == 1)
        {
          algo_status = 0; //not done
          sqi_algo_stop_cnt = adi_GetEndCycleCount();
          gn_sqi_algo_cycle_cnt = sqi_algo_stop_cnt - sqi_algo_start_cnt;
        }
#endif //#ifdef PROFILE_TIME
        return SQI_ALG_SUCCESS;
    }
    default:
    {
        return SQI_ALG_ERROR;
    }
    }
}

SQI_ALG_RETURN_CODE_t sqi_algo_init(uint8_t input_sample_freq)
{
  SQI_ALG_RETURN_CODE_t ret_code;

  ret_code = SqiAlgConfig(input_sample_freq);
  ASSERT(ret_code == SQI_ALG_SUCCESS);

  ret_code = SqiAlgInit(&config_handle);
  ASSERT(ret_code == SQI_ALG_SUCCESS);

  return ret_code;
}
#endif
/******************************************************************************************/